# Family Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilySymbol..::..Family Property
FamilySymbol Class See Also
---
The Family object to which the symbol belongs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Family Family { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Family As Family
	Get
```

Visual C++
---
```text
public:
property Family^ Family {
	Family^ get ();
}
```

# See Also
FamilySymbol Class
Autodesk.Revit.DB Namespace